trade_exp/src/Catalogs/ДействияАкций/ДействияАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e7756233-af10-40b5-874c-381c2f05160c">
  <name>ДействияАкций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="094a890a-fe19-4ef6-a4ca-035184b9f479">
    <name>Алгоритм</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b145cb58-7697-41fc-96fe-6b832992cde0">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="746a8cf6-03be-490e-bd9a-b3eccc6b5137">
    <name>ПроцентБонусов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b698ce03-8156-4799-8108-1b085c3b8531">
    <name>СтатусУчастникаБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4448fa72-bbc4-4c15-9068-190b3cc6f5c4">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9c7be334-0b61-4591-b3c0-2cd19b00dd86">
    <name>СуммаБонусов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02dd3cad-75ce-4e54-aac1-c8b6fe39693c">
    <name>Причина</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Enums/ТипыДействияМаркетинговыхМероприятий/ТипыДействияМаркетинговыхМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d1a99da-ba46-4dee-b77e-6acdaf25f112">
  <name>ТипыДействияМаркетинговыхМероприятий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5eafd854-5f16-4357-b069-5d7c4f969104">
    <name>СменитьСтатусУчастникаБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d3289f14-5ea3-47b6-a253-33b0f697d00f">
    <name>НачислитьБонусыСуммой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be142fa8-0902-4895-8dbc-f1ab2a79bed7">
    <name>УстановитьВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="375c2168-afdc-4f60-9d65-471130e7ffb4">
    <name>НачислитьБонусыПроцентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ДействияАкций/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПриИзмененииТипа();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьПриИзмененииТипа();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьПриИзмененииТипа()
	
	Элементы.ПроцентБонусов.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыПроцентом);
	Элементы.ВидЦены.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.УстановитьВидЦены);
	Элементы.СуммаБонусов.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой ИЛИ Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыЗаНовогоКлиента);
	Элементы.Причина.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыСуммой ИЛИ Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.НачислитьБонусыЗаНовогоКлиента);
	Элементы.СтатусУчастникаБонуснойПрограммы.Видимость = (Объект.Тип=Перечисления.ТипыДействияМаркетинговыхМероприятий.СменитьСтатусУчастникаБонуснойПрограммы);
	
КонецПроцедуры


#КонецОбласти
